#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
tls_private_key.trend-getter-key: Refreshing state... [id=a47ca5ce69932d82542644f179386827027c4e11]
data.aws_iam_policy_document.ecs_task_assume: Reading...
data.aws_iam_policy_document.lambda_permissions_notif: Reading...
data.aws_iam_policy_document.lambda_role: Reading...
data.aws_subnet.public_1: Reading...
aws_ecr_repository.c18-trend-getter-notifications-ecr: Refreshing state... [id=c18-trend-getter-notifications-ecr]
aws_key_pair.trend-getter-ec2-key: Refreshing state... [id=c18-trend-getter-kp]
aws_cloudwatch_log_group.streamlit: Refreshing state... [id=/ecs/streamlit]
aws_iam_policy.step_function_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
aws_ecr_repository.trend-getter-extract-and-load-ecr: Refreshing state... [id=trend-getter-extract-and-load-ecr]
data.aws_iam_policy_document.lambda_permissions: Reading...
data.aws_iam_policy_document.ecs_task_assume: Read complete after 0s [id=1077804475]
data.aws_iam_policy_document.lambda_role: Read complete after 0s [id=3917546067]
data.aws_iam_policy_document.lambda_permissions_notif: Read complete after 0s [id=2637988731]
data.aws_subnet.public_3: Reading...
aws_ecs_cluster.cluster: Refreshing state... [id=arn:aws:ecs:eu-west-2:129033205317:cluster/c18-ecs-cluster]
aws_s3_bucket.c18-trend-getter-s3: Refreshing state... [id=c18-trend-getter-s3]
data.aws_iam_policy_document.lambda_permissions: Read complete after 0s [id=1274356838]
data.aws_subnet.public_2: Reading...
aws_ecr_repository.c18-trend-getter-bsky-bot-ecr: Refreshing state... [id=c18-trend-getter-bsky-bot-ecr]
data.aws_iam_policy_document.lambda_role_notif: Reading...
data.aws_iam_policy_document.lambda_role_notif: Read complete after 0s [id=2690255455]
aws_cloudwatch_event_rule.s3_put_event: Refreshing state... [id=trigger-stepfunction-on-upload]
aws_iam_role.step_function_role: Refreshing state... [id=step-function-execution-role]
aws_iam_role.eventbridge_invoke_stepfunction_role: Refreshing state... [id=c18-tg-event-sm-role]
data.aws_subnet.public_1: Read complete after 0s [id=subnet-0679d4b1f9e7839ef]
aws_ecr_repository.trend-getter-lambda-ecr: Refreshing state... [id=trend-getter-lambda-ecr]
data.aws_subnet.public_3: Read complete after 0s [id=subnet-0aed07ac008a10da9]
data.aws_vpc.main: Reading...
data.aws_subnet.public_2: Read complete after 0s [id=subnet-0f10662561eade8c3]
aws_ecr_repository.c18-trend-getter-dashboard-ecr: Refreshing state... [id=c18-trend-getter-dashboard-ecr]
aws_iam_role.ecs_task_execution: Refreshing state... [id=c18-trendgetter-ecsTaskExecutionRole]
aws_iam_role.lambda_role: Refreshing state... [id=c18-data-getter-lambda-role]
aws_iam_policy.lambda_s3_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_iam_role.lambda_role_notif: Refreshing state... [id=c18-data-getter-notif-lambda-role]
aws_db_subnet_group.rds_subnet_group: Refreshing state... [id=c18-trend-getter-rds-subnet-group]
aws_iam_role_policy_attachment.exec_policy: Refreshing state... [id=c18-trendgetter-ecsTaskExecutionRole/arn:aws:iam::aws:policy/service-role/AmazonECSTaskExecutionRolePolicy]
aws_ecs_task_definition.streamlit: Refreshing state... [id=c18-trendgetter-streamlit-td]
aws_iam_role_policy_attachment.step_function_attach_policy: Refreshing state... [id=step-function-execution-role/arn:aws:iam::129033205317:policy/step-function-lambda-invoke-policy]
aws_iam_role_policy_attachment.lambda_s3_attach: Refreshing state... [id=c18-data-getter-lambda-role/arn:aws:iam::129033205317:policy/c18-data-getter-lambda-s3-policy]
aws_lambda_function.lambda_function: Refreshing state... [id=c18-trend-getter-lambda-function]
aws_lambda_function.lambda_function_notif: Refreshing state... [id=c18-trend-getter-notifications-function]
data.aws_vpc.main: Read complete after 1s [id=vpc-0adcb6a62ca552c01]
aws_security_group.ecs: Refreshing state... [id=sg-0fcb830e6490c3433]
aws_security_group.rds_sg: Refreshing state... [id=sg-0699c97d0de8afddc]
aws_security_group.trend-getter-ec2-sg: Refreshing state... [id=sg-0ec95d6742c91e9bb]
aws_lambda_permission.allow_lambda: Refreshing state... [id=AllowExecutionFromETLLambda]
aws_sfn_state_machine.etl_sm: Refreshing state... [id=arn:aws:states:eu-west-2:129033205317:stateMachine:c18-trendgetter-etl-notif-sm]
aws_db_instance.postgresql: Refreshing state... [id=db-UU2R632XBCS7PYO2UOF2LKE3AE]
aws_instance.ec2: Refreshing state... [id=i-034fe5b94adc3d579]
aws_ecs_service.streamlit: Refreshing state... [id=arn:aws:ecs:eu-west-2:129033205317:service/c18-ecs-cluster/c18-trendgetter-streamlit-service]
aws_s3_bucket_notification.s3_eventbridge: Refreshing state... [id=c18-trend-getter-s3]
aws_lambda_permission.allow_s3: Refreshing state... [id=AllowExecutionFromS3]
aws_s3_bucket_notification.s3_trigger: Refreshing state... [id=c18-trend-getter-s3]
aws_iam_policy.eventbridge_invoke_stepfunction_policy: Refreshing state... [id=arn:aws:iam::129033205317:policy/c18-tg-event-policy]
aws_cloudwatch_event_target.trigger_stepfunction: Refreshing state... [id=trigger-stepfunction-on-upload-terraform-20250807171207781800000002]
aws_iam_role_policy_attachment.attach_eventbridge_invoke_stepfunction: Refreshing state... [id=c18-tg-event-sm-role/arn:aws:iam::129033205317:policy/c18-tg-event-policy]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_lambda_function.lambda_function_bsky_bot will be created
  + resource "aws_lambda_function" "lambda_function_bsky_bot" {
      + architectures                  = [
          + "x86_64",
        ]
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + function_name                  = "c18-trend-getter-bsky-bot"
      + id                             = (known after apply)
      + image_uri                      = "129033205317.dkr.ecr.eu-west-2.amazonaws.com/c18-trend-getter-bsky-bot-ecr:latest"
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 7168
      + package_type                   = "Image"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + region                         = "eu-west-2"
      + reserved_concurrent_executions = -1
      + role                           = "arn:aws:iam::129033205317:role/c18-data-getter-notif-lambda-role"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags_all                       = (known after apply)
      + timeout                        = 300
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BLUESKY_EMAIL"    = (sensitive value)
              + "BLUESKY_PASSWORD" = (sensitive value)
            }
        }

      + ephemeral_storage (known after apply)

      + logging_config (known after apply)

      + tracing_config (known after apply)
    }

  # aws_s3_bucket_notification.s3_eventbridge will be updated in-place
  ~ resource "aws_s3_bucket_notification" "s3_eventbridge" {
      ~ eventbridge = false -> true
        id          = "c18-trend-getter-s3"
        # (2 unchanged attributes hidden)

      - lambda_function {
          - events              = [
              - "s3:ObjectCreated:*",
            ] -> null
          - id                  = "tf-s3-lambda-20250808100035898900000001" -> null
          - lambda_function_arn = "arn:aws:lambda:eu-west-2:129033205317:function:c18-trend-getter-lambda-function" -> null
            # (2 unchanged attributes hidden)
        }
    }

Plan: 1 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @jacoblewis046, Action: `pull_request`*